RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L43x_Firmware_Library/CMSIS/device/n32l43x.h
/******************  Bit definition for LPTIM_CFG register *******************/
#define LPTIM_CFG_CLKSEL                     ((uint32_t)0x00000001)       /*!< Clock selector */

#define LPTIM_CFG_CLKPOL                     ((uint32_t)0x00000006)       /*!< CLKP[1:0] bits (Clock polarity) */
#define LPTIM_CFG_CLKPOL_0                   ((uint32_t)0x00000002)       /*!< 0x00000002 */
#define LPTIM_CFG_CLKPOL_1                   ((uint32_t)0x00000004)       /*!< 0x00000004 */

#define LPTIM_CFG_CLKFLT                     ((uint32_t)0x00000018)       /*!< CFGDFFEXT[1:0] bits (Configurable digital filter for external clock) */
#define LPTIM_CFG_CLKFLT_0                   ((uint32_t)0x00000008)       /*!< 0x00000008 */
#define LPTIM_CFG_CLKFLT_1                   ((uint32_t)0x00000010)       /*!< 0x00000010 */

#define LPTIM_CFG_TRIGFLT                    ((uint32_t)0x000000C0)       /*!< CFGDFFTRG[1:0] bits (Configurable digital filter for trigger) */
#define LPTIM_CFG_TRIGFLT_0                  ((uint32_t)0x00000040)       /*!< 0x00000040 */
#define LPTIM_CFG_TRIGFLT_1                  ((uint32_t)0x00000080)       /*!< 0x00000080 */

#define LPTIM_CFG_CLKPRE                     ((uint32_t)0x00000E00)       /*!< CLKPRE[2:0] bits (Clock prescaler) */
#define LPTIM_CFG_CLKPRE_0                   ((uint32_t)0x00000200)       /*!< 0x00000200 */
#define LPTIM_CFG_CLKPRE_1                   ((uint32_t)0x00000400)       /*!< 0x00000400 */
#define LPTIM_CFG_CLKPRE_2                   ((uint32_t)0x00000800)       /*!< 0x00000800 */

#define LPTIM_CFG_TRGSEL                   ((uint32_t)0x0000E000)       /*!< TRGS[2:0]] bits (Trigger selector) */
#define LPTIM_CFG_TRGSEL_0                 ((uint32_t)0x00002000)       /*!< 0x00002000 */
#define LPTIM_CFG_TRGSEL_1                 ((uint32_t)0x00004000)       /*!< 0x00004000 */
#define LPTIM_CFG_TRGSEL_2                 ((uint32_t)0x00008000)       /*!< 0x00008000 */

#define LPTIM_CFG_TRGEN                    ((uint32_t)0x00060000)       /*!< TRGEN[1:0] bits (Trigger enable and polarity) */
#define LPTIM_CFG_TRGEN_0                  ((uint32_t)0x00020000)       /*!< 0x00020000 */
#define LPTIM_CFG_TRGEN_1                  ((uint32_t)0x00040000)       /*!< 0x00040000 */

#define LPTIM_CFG_TIMOUTEN                  ((uint32_t)0x00080000)       /*!< Timout enable */
#define LPTIM_CFG_WAVE                      ((uint32_t)0x00100000)       /*!< Waveform shape */
#define LPTIM_CFG_WAVEPOL                   ((uint32_t)0x00200000)       /*!< Waveform shape polarity */
#define LPTIM_CFG_RELOAD                    ((uint32_t)0x00400000)       /*!< Reg update mode */
#define LPTIM_CFG_CNTMEN                    ((uint32_t)0x00800000)       /*!< Counter mode enable */
#define LPTIM_CFG_ENC                       ((uint32_t)0x01000000)       /*!< Encoder mode enable */
#define LPTIM_CFG_NENC                      ((uint32_t)0x02000000)       /*!< NONEncoder mode enable */
/******************  Bit definition for LPTIM_CTRL register  ********************/
#define LPTIM_CTRL_LPTIMEN                      ((uint32_t)0x000000001)      /*!< LPTIMer enable */
#define LPTIM_CTRL_SNGMST                       ((uint32_t)0x000000002)      /*!< Timer start in single mode */
#define LPTIM_CTRL_TSTCM                        ((uint32_t)0x000000004)      /*!< Timer start in continuous mode */

/******************  Bit definition for LPTIM_CMPT register  *******************/
#define LPTIM_COMP_CMPVAL                          ((uint16_t)0xFFFF)           /*!< Compare register */

/******************  Bit definition for LPTIM_AUTRLD register  *******************/
#define LPTIM_ARR_ARRVAL                     ((uint16_t)0xFFFF)           /*!< Auto reload register */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_CNT_CNTVAL                        ((uint16_t)0xFFFF)           /*!< Counter register */
/******************************************************************************/
/*                                                                            */
/*                           Low-Power RCNT (LPRCNT)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for LPRCNT_CTRL register  *******************/
#define LPRCNT_CTRL_RPTTH                       ((uint32_t)0x0000FFFF)      /*!< threshold of RCNT value, interrupt to wake up CPU when the value reach it */
#define LPRCNT_CTRL_CLKDIV                      ((uint32_t)0x00030000)      /*!< MSI clock to decide processing precision of sensors */
#define LPRCNT_CTRL_AVGSEL                      ((uint32_t)0x000C0000)      /*!< auto calculate average  data for multi time */
#define LPRCNT_CTRL_CNTDIR                       ((uint32_t)0x00100000)      /*!< direction mode, turn lprcnt counting to the opposite direction */

#define LPRCNT_CTRL_PWRLVL                       ((uint32_t)0x00600000)      /*!< power level select */
#define LPRCNT_CTRL_PWRLVL1V5                    ((uint32_t)0x00000000)      /*!< power level select 1.5V */
#define LPRCNT_CTRL_PWRLVL1V6                    ((uint32_t)0x00200000)      /*!< power level select 1.6V */
#define LPRCNT_CTRL_PWRLVL1V8                    ((uint32_t)0x00400000)      /*!< power level select 1.8V */
#define LPRCNT_CTRL_PWRLVL2V                     ((uint32_t)0x00600000)      /*!< power level select 2.0V */
#define LPRCNT_CTRL_CMPAUT                       ((uint32_t)0x00800000)     /*!< enable to auto detect  comparator stop */
#define LPRCNT_CTRL_RCNTM                        ((uint32_t)0x01000000)       /*!< RCNT RUN mode enable */
#define LPRCNT_CTRL_CALM                         ((uint32_t)0x02000000)       /*!< sensor data processing mode in RCNT debug mode */
#define LPRCNT_CTRL_ALMPRD                        ((uint32_t)0x0C000000)       /*!< the alarm sensor prescale */
#define LPRCNT_CTRL_ALMPRD4                       ((uint32_t)0x00000000)      /*!< the alarm sensor prescale /4 */
#define LPRCNT_CTRL_ALMPRD8                       ((uint32_t)0x04000000)      /*!< the alarm sensor prescale /8 */
#define LPRCNT_CTRL_ALMPRD16                      ((uint32_t)0x08000000)      /*!< the alarm sensor prescale /16 */
#define LPRCNT_CTRL_ALMPRD32                      ((uint32_t)0x0C000000)      /*!< the alarm sensor prescale /32 */

#define LPRCNT_CTRL_ALMIE                       ((uint32_t)0x10000000)      /*!< the alarm sensor interruput enable */
#define LPRCNT_CTRL_RPTIE                       ((uint32_t)0x20000000)      /*!< reading interruput enable */
#define LPRCNT_CTRL_CALIE                       ((uint32_t)0x40000000)      /*!< the sensor debug mode interruput enable */

/********************  Bits definition for LPRCNT_INTSTS register  *******************/
#define LPRCNT_INTSTS_RPTVAL                    ((uint32_t)0x0000FFFF)      /*!< lprcnt counter value report */
#define LPRCNT_INTSTS_ALMIF                     ((uint32_t)0x00010000)      /*!< RCNT alarm interrupt status*/
#define LPRCNT_INTSTS_RPTIF                     ((uint32_t)0x00020000)      /*!< RCNT read interrupt status*/
#define LPRCNT_INTSTS_CALIF                     ((uint32_t)0x00040000)      /*!< RCNT debug interrupt status*/

