RT-Thread/rt-thread/bsp/n32/n32gxx_lxx/libraries/N32L43x_Firmware_Library/CMSIS/device/n32l43x.h
/********************  Bits definition for LPRCNT_SCTRL register  *******************/
#define LPRCNT_SCTRL_HSPRD                      ((uint32_t)0x000000FF)      /*!< lprcnt high mode scan period */
#define LPRCNT_SCTRL_SWT                       ((uint32_t)0x0000FF00)      /*!< lprcnt high mode VS low mode switch time */
#define LPRCNT_SCTRL_LSPRD                      ((uint32_t)0x03FF0000)      /*!< lprcnt low mode scan period */

/********************  Bits definition for LPRCNT_CH0CFG0 register  *******************/
#define LPRCNT_CH0CFG0_DAMTH                      ((uint32_t)0x000000FF)      /*!< sensor channel 0 damped threshold,less than to be detect damped */
#define LPRCNT_CH0CFG0_UNDTH                      ((uint32_t)0x0000FF00)      /*!< sensor channel 0 undamped threshold,less than to be detect undamped */
#define LPRCNT_CH0CFG0_DACREF                     ((uint32_t)0x003F0000)      /*!< sensor channel 0 damped threshold,less than to be detect damped */

/********************  Bits definition for LPRCNT_CH0CFG1 register  *******************/
#define LPRCNT_CH0CFG1_CHGDUR                     ((uint32_t)0x0000003F)      /*!< power processing duration length */
#define LPRCNT_CH0CFG1_DSCDUR                     ((uint32_t)0x00003F00)      /*!< discharge processing duration length */
#define LPRCNT_CH0CFG1_DAMDUR                     ((uint32_t)0x00FF0000)      /*!< comparator processing duration length */
/********************  Bits definition for LPRCNT_CH1CFG0 register  *******************/
#define LPRCNT_CH1CFG0_DAMTH                      ((uint32_t)0x000000FF)      /*!< sensor channel 1 damped threshold,less than to be detect damped */
#define LPRCNT_CH1CFG0_UNDTH                      ((uint32_t)0x0000FF00)      /*!< sensor channel 1 undamped threshold,less than to be detect undamped */
#define LPRCNT_CH1CFG0_DACREF                     ((uint32_t)0x003F0000)      /*!< sensor channel 1 damped threshold,less than to be detect damped */

/********************  Bits definition for LPRCNT_CH1CFG1 register  *******************/
#define LPRCNT_CH1CFG1_CHGDUR                     ((uint32_t)0x0000003F)      /*!< power processing duration length */
#define LPRCNT_CH1CFG1_DSCDUR                     ((uint32_t)0x00003F00)      /*!< discharge processing duration length */
#define LPRCNT_CH1CFG1_DAMDUR                    ((uint32_t)0x00FF0000)      /*!< comparator processing duration length */
/********************  Bits definition for LPRCNT_CH2CFG0 register  *******************/
#define LPRCNT_CH2CFG0_DAMTH                      ((uint32_t)0x000000FF)      /*!< sensor channel 2 damped threshold,less than to be detect damped */
#define LPRCNT_CH2CFG0_UNDTH                      ((uint32_t)0x0000FF00)      /*!< sensor channel 2 undamped threshold,less than to be detect undamped */
#define LPRCNT_CH2CFG0_DACREF                     ((uint32_t)0x003F0000)      /*!< sensor channel 2 damped threshold,less than to be detect damped */

/********************  Bits definition for LPRCNT_CH2CFG1 register  *******************/
#define LPRCNT_CH2CFG1_CHGDUR                     ((uint32_t)0x0000003F)      /*!< power processing duration length */
#define LPRCNT_CH2CFG1_DSCDUR                     ((uint32_t)0x00003F00)      /*!< discharge processing duration length */
#define LPRCNT_CH2CFG1_DAMDUR                     ((uint32_t)0x00FF0000)      /*!< comparator processing duration length */

/********************  Bits definition for LPRCNT_CMD register  *******************/
#define LPRCNT_CMD_START                     ((uint32_t)0x00000001)      /*!< start LPRCNT processing */
#define LPRCNT_CMD_STOP                      ((uint32_t)0x00000002)      /*!< stop LPRCNT processing */
#define LPRCNT_CMD_CLRCNT                    ((uint32_t)0x00000004)      /*!< clear LPRCNT count */

/********************  Bits definition for LPRCNT_CAL0 register  *******************/
#define LPRCNT_CAL0_CH0CNT                     ((uint32_t)0x000000FF)          /*!< sensor channel 0,comparator output valid count */

#define LPRCNT_CAL0_CH0STS_UND                     ((uint32_t)0x00000000)      /*!< sensor channel 0 undamped state */
#define LPRCNT_CAL0_CH0STS_MID                     ((uint32_t)0x00000100)      /*!< sensor channel 0 middle state */
#define LPRCNT_CAL0_CH0STS_DAM                     ((uint32_t)0x00000200)      /*!< sensor channel 0 damped state */

#define LPRCNT_CAL0_CH1CNT                     ((uint32_t)0x00FF0000)          /*!< sensor channel 1,comparator output valid count */

#define LPRCNT_CAL0_CH1STS_UND                     ((uint32_t)0x00000000)      /*!< sensor channel 1 undamped state */
#define LPRCNT_CAL0_CH1STS_MID                     ((uint32_t)0x01000000)      /*!< sensor channel 1 middle state */
#define LPRCNT_CAL0_CH1STS_DAM                     ((uint32_t)0x02000000)      /*!< sensor channel 1 damped state */
/********************  Bits definition for LPRCNT_CAL1 register  *******************/
#define LPRCNT_CAL1_CH2CNT                     ((uint32_t)0x000000FF)          /*!< sensor channel 0,comparator output valid count */

#define LPRCNT_CAL1_CH2STS_UND                     ((uint32_t)0x00000000)      /*!< sensor channel 2 undamped state */
#define LPRCNT_CAL1_CH2STS_MID                     ((uint32_t)0x00000100)      /*!< sensor channel 2 middle state */
#define LPRCNT_CAL1_CH2STS_DAM                     ((uint32_t)0x00000200)      /*!< sensor channel 2 damped state */

/********************  Bits definition for LPRCNT_CAL2 register  *******************/
#define LPRCNT_CAL2_DACSET                     ((uint32_t)0x0000003F)            /*!< sensor channel DAC setup time */
#define LPRCNT_CAL2_CMPSET                     ((uint32_t)0x00003F00)            /*!< sensor channel comparator setup time */
#define LPRCNT_CAL2_GAP                        ((uint32_t)0x000F0000)            /*!< charge  to discharge gap time length */
#define LPRCNT_CAL2_RCNTADJ                    ((uint32_t)0x00F00000)            /*!< adjust number for slow switch fast lost */
#define LPRCNT_CAL2_SAMPMODE                   ((uint32_t)0x02000000)            /*!< LPRCNT module sample mode */

/********************  Bits definition for LPRCNT_CAL3 register  *******************/
#define LPRCNT_CAL3_CMP_AUTO_MODE                     ((uint32_t)0x00000040)            /*!< when enter the mode of auto detect comparator stop, the period of duty wait clock */
#define LPRCNT_CAL3_PWR_DUR_EN                        ((uint32_t)0x00000080)            /*!< LDO powering sensors by time duration */
#define LPRCNT_CAL3_STAT_CLR_CTRL                     ((uint32_t)0x00000100)            /*!< Whether clear state on fast mode to slow mode */
#define LPRCNT_CAL3_DAC_CMP_ALWSON                    ((uint32_t)0x00000200)            /*!< DAC & CMP always on enable while 1 round sampling */
#define LPRCNT_CAL3_CMP_HYSEL                         ((uint32_t)0x00000C00)            /*!< Comparator hysteresis selection */
#define LPRCNT_CAL3_CMP_HYSEL_NULL                    ((uint32_t)0x00000000)            /*!< Comparator hysteresis disable */
#define LPRCNT_CAL3_CMP_HYSEL_LOW                     ((uint32_t)0x00000400)            /*!< select low Comparator hysteresis */
#define LPRCNT_CAL3_CMP_HYSEL_MID                     ((uint32_t)0x00000800)            /*!< select middle Comparator hysteresis */
#define LPRCNT_CAL3_CMP_HYSEL_HIGH                    ((uint32_t)0x00000C00)            /*!< select high Comparator hysteresis */
#define LPRCNT_CAL3_CMP_INMSEL                        ((uint32_t)0x00007000)            /*!< COMP input minus selection bits */
#define LPRCNT_CAL3_CMP_LPEN                          ((uint32_t)0x00008000)            /*!< COMP low power enable */

#define LPRCNT_CAL3_ANGFILEN                     ((uint32_t)0x00200000)            /*!< Analog filtering anable bit */
#define LPRCNT_CAL3_DIGFILPH                     ((uint32_t)0x00400000)            /*!< Digital filter phase control */
#define LPRCNT_CAL3_DIGFILPH_P                   ((uint32_t)0x00000000)            /*!< Digital filter phase selection positive */
#define LPRCNT_CAL3_DIGFILPH_N                   ((uint32_t)0x00400000)            /*!< Digital filter phase selection negative */
#define LPRCNT_CAL3_FILTH                        ((uint32_t)0x01800000)            /*!< Filter threshold control*/
#define LPRCNT_CAL3_DIGFILEN                     ((uint32_t)0x02000000)            /*!< Digital filtering anable bit */
#define LPRCNT_CAL3_CH0MAP                     ((uint32_t)0x0C000000)            /*!< CH0 map to which sensor select */
#define LPRCNT_CAL3_CH1MAP                     ((uint32_t)0x30000000)            /*!< CH1 map to which sensor select */
#define LPRCNT_CAL3_CH2MAP                     ((uint32_t)0xC0000000)            /*!< CH2 map to which sensor select */
/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TSH register  *******************/
#define RTC_TSH_APM   ((uint32_t)0x00400000)
#define RTC_TSH_HOT   ((uint32_t)0x00300000)
#define RTC_TSH_HOT_0 ((uint32_t)0x00100000)
#define RTC_TSH_HOT_1 ((uint32_t)0x00200000)
#define RTC_TSH_HOU   ((uint32_t)0x000F0000)
#define RTC_TSH_HOU_0 ((uint32_t)0x00010000)
#define RTC_TSH_HOU_1 ((uint32_t)0x00020000)
#define RTC_TSH_HOU_2 ((uint32_t)0x00040000)
#define RTC_TSH_HOU_3 ((uint32_t)0x00080000)
#define RTC_TSH_MIT   ((uint32_t)0x00007000)
#define RTC_TSH_MIT_0 ((uint32_t)0x00001000)
#define RTC_TSH_MIT_1 ((uint32_t)0x00002000)
#define RTC_TSH_MIT_2 ((uint32_t)0x00004000)
#define RTC_TSH_MIU   ((uint32_t)0x00000F00)
#define RTC_TSH_MIU_0 ((uint32_t)0x00000100)
#define RTC_TSH_MIU_1 ((uint32_t)0x00000200)
#define RTC_TSH_MIU_2 ((uint32_t)0x00000400)
#define RTC_TSH_MIU_3 ((uint32_t)0x00000800)
#define RTC_TSH_SCT   ((uint32_t)0x00000070)
#define RTC_TSH_SCT_0 ((uint32_t)0x00000010)
#define RTC_TSH_SCT_1 ((uint32_t)0x00000020)
#define RTC_TSH_SCT_2 ((uint32_t)0x00000040)
#define RTC_TSH_SCU   ((uint32_t)0x0000000F)
#define RTC_TSH_SCU_0 ((uint32_t)0x00000001)
#define RTC_TSH_SCU_1 ((uint32_t)0x00000002)
#define RTC_TSH_SCU_2 ((uint32_t)0x00000004)
#define RTC_TSH_SCU_3 ((uint32_t)0x00000008)

/********************  Bits definition for RTC_DATE register  *******************/
#define RTC_DATE_YRT   ((uint32_t)0x00F00000)
#define RTC_DATE_YRT_0 ((uint32_t)0x00100000)
#define RTC_DATE_YRT_1 ((uint32_t)0x00200000)
#define RTC_DATE_YRT_2 ((uint32_t)0x00400000)
#define RTC_DATE_YRT_3 ((uint32_t)0x00800000)
#define RTC_DATE_YRU   ((uint32_t)0x000F0000)
#define RTC_DATE_YRU_0 ((uint32_t)0x00010000)
#define RTC_DATE_YRU_1 ((uint32_t)0x00020000)
#define RTC_DATE_YRU_2 ((uint32_t)0x00040000)
#define RTC_DATE_YRU_3 ((uint32_t)0x00080000)
#define RTC_DATE_WDU   ((uint32_t)0x0000E000)
#define RTC_DATE_WDU_0 ((uint32_t)0x00002000)
#define RTC_DATE_WDU_1 ((uint32_t)0x00004000)
#define RTC_DATE_WDU_2 ((uint32_t)0x00008000)
#define RTC_DATE_MOT   ((uint32_t)0x00001000)
#define RTC_DATE_MOU   ((uint32_t)0x00000F00)
#define RTC_DATE_MOU_0 ((uint32_t)0x00000100)
#define RTC_DATE_MOU_1 ((uint32_t)0x00000200)
#define RTC_DATE_MOU_2 ((uint32_t)0x00000400)
#define RTC_DATE_MOU_3 ((uint32_t)0x00000800)
#define RTC_DATE_DAT   ((uint32_t)0x00000030)
#define RTC_DATE_DAT_0 ((uint32_t)0x00000010)
#define RTC_DATE_DAT_1 ((uint32_t)0x00000020)
#define RTC_DATE_DAU   ((uint32_t)0x0000000F)
#define RTC_DATE_DAU_0 ((uint32_t)0x00000001)
#define RTC_DATE_DAU_1 ((uint32_t)0x00000002)
#define RTC_DATE_DAU_2 ((uint32_t)0x00000004)
#define RTC_DATE_DAU_3 ((uint32_t)0x00000008)

/********************  Bits definition for RTC_CTRL register  *******************/
#define RTC_CTRL_COEN     ((uint32_t)0x00800000)
#define RTC_CTRL_OUTSEL   ((uint32_t)0x00600000)
#define RTC_CTRL_OUTSEL_0 ((uint32_t)0x00200000)
#define RTC_CTRL_OUTSEL_1 ((uint32_t)0x00400000)
#define RTC_CTRL_OPOL     ((uint32_t)0x00100000)
#define RTC_CTRL_CALOSEL  ((uint32_t)0x00080000)
#define RTC_CTRL_BAKP     ((uint32_t)0x00040000)
#define RTC_CTRL_SU1H     ((uint32_t)0x00020000)
#define RTC_CTRL_AD1H     ((uint32_t)0x00010000)
#define RTC_CTRL_TSIEN    ((uint32_t)0x00008000)
#define RTC_CTRL_WTIEN    ((uint32_t)0x00004000)
#define RTC_CTRL_ALBIEN   ((uint32_t)0x00002000)
#define RTC_CTRL_ALAIEN   ((uint32_t)0x00001000)
#define RTC_CTRL_TSEN     ((uint32_t)0x00000800)
#define RTC_CTRL_WTEN     ((uint32_t)0x00000400)
#define RTC_CTRL_ALBEN    ((uint32_t)0x00000200)
#define RTC_CTRL_ALAEN    ((uint32_t)0x00000100)

#define RTC_CTRL_HFMT      ((uint32_t)0x00000040)
#define RTC_CTRL_BYPS      ((uint32_t)0x00000020)
#define RTC_CTRL_REFCLKEN  ((uint32_t)0x00000010)
#define RTC_CTRL_TEDGE     ((uint32_t)0x00000008)
#define RTC_CTRL_WKUPSEL   ((uint32_t)0x00000007)
#define RTC_CTRL_WKUPSEL_0 ((uint32_t)0x00000001)
#define RTC_CTRL_WKUPSEL_1 ((uint32_t)0x00000002)
#define RTC_CTRL_WKUPSEL_2 ((uint32_t)0x00000004)

/********************  Bits definition for RTC_INITSTS register  ******************/
#define RTC_INITSTS_RECPF  ((uint32_t)0x00010000)
#define RTC_INITSTS_TAM3F  ((uint32_t)0x00008000)
#define RTC_INITSTS_TAM2F  ((uint32_t)0x00004000)
#define RTC_INITSTS_TAM1F  ((uint32_t)0x00002000)
#define RTC_INITSTS_TISOVF ((uint32_t)0x00001000)
#define RTC_INITSTS_TISF   ((uint32_t)0x00000800)
#define RTC_INITSTS_WTF    ((uint32_t)0x00000400)
#define RTC_INITSTS_ALBF   ((uint32_t)0x00000200)
#define RTC_INITSTS_ALAF   ((uint32_t)0x00000100)
#define RTC_INITSTS_INITM  ((uint32_t)0x00000080)
#define RTC_INITSTS_INITF  ((uint32_t)0x00000040)
#define RTC_INITSTS_RSYF   ((uint32_t)0x00000020)
#define RTC_INITSTS_INITSF ((uint32_t)0x00000010)
#define RTC_INITSTS_SHOPF  ((uint32_t)0x00000008)
#define RTC_INITSTS_WTWF   ((uint32_t)0x00000004)
#define RTC_INITSTS_ALBWF  ((uint32_t)0x00000002)
#define RTC_INITSTS_ALAWF  ((uint32_t)0x00000001)

/********************  Bits definition for RTC_PRE register  *****************/
#define RTC_PRE_DIVA ((uint32_t)0x007F0000)
#define RTC_PRE_DIVS ((uint32_t)0x00007FFF)

/********************  Bits definition for RTC_WKUPT register  *****************/
#define RTC_WKUPT_WKUPT ((uint32_t)0x0000FFFF)


/********************  Bits definition for RTC_ALARMA register  ***************/
#define RTC_ALARMA_MASK4  ((uint32_t)0x80000000)
#define RTC_ALARMA_WKDSEL ((uint32_t)0x40000000)
#define RTC_ALARMA_DTT    ((uint32_t)0x30000000)
#define RTC_ALARMA_DTT_0  ((uint32_t)0x10000000)
#define RTC_ALARMA_DTT_1  ((uint32_t)0x20000000)
#define RTC_ALARMA_DTU    ((uint32_t)0x0F000000)
#define RTC_ALARMA_DTU_0  ((uint32_t)0x01000000)
#define RTC_ALARMA_DTU_1  ((uint32_t)0x02000000)
#define RTC_ALARMA_DTU_2  ((uint32_t)0x04000000)
#define RTC_ALARMA_DTU_3  ((uint32_t)0x08000000)
#define RTC_ALARMA_MASK3  ((uint32_t)0x00800000)
#define RTC_ALARMA_APM    ((uint32_t)0x00400000)
#define RTC_ALARMA_HOT    ((uint32_t)0x00300000)
#define RTC_ALARMA_HOT_0  ((uint32_t)0x00100000)
#define RTC_ALARMA_HOT_1  ((uint32_t)0x00200000)
#define RTC_ALARMA_HOU    ((uint32_t)0x000F0000)
#define RTC_ALARMA_HOU_0  ((uint32_t)0x00010000)
#define RTC_ALARMA_HOU_1  ((uint32_t)0x00020000)
#define RTC_ALARMA_HOU_2  ((uint32_t)0x00040000)
#define RTC_ALARMA_HOU_3  ((uint32_t)0x00080000)
#define RTC_ALARMA_MASK2  ((uint32_t)0x00008000)
#define RTC_ALARMA_MIT    ((uint32_t)0x00007000)
#define RTC_ALARMA_MIT_0  ((uint32_t)0x00001000)
#define RTC_ALARMA_MIT_1  ((uint32_t)0x00002000)
#define RTC_ALARMA_MIT_2  ((uint32_t)0x00004000)
#define RTC_ALARMA_MIU    ((uint32_t)0x00000F00)
#define RTC_ALARMA_MIU_0  ((uint32_t)0x00000100)
#define RTC_ALARMA_MIU_1  ((uint32_t)0x00000200)
#define RTC_ALARMA_MIU_2  ((uint32_t)0x00000400)
#define RTC_ALARMA_MIU_3  ((uint32_t)0x00000800)
#define RTC_ALARMA_MASK1  ((uint32_t)0x00000080)
#define RTC_ALARMA_SET    ((uint32_t)0x00000070)
#define RTC_ALARMA_SET_0  ((uint32_t)0x00000010)
#define RTC_ALARMA_SET_1  ((uint32_t)0x00000020)
#define RTC_ALARMA_SET_2  ((uint32_t)0x00000040)
#define RTC_ALARMA_SEU    ((uint32_t)0x0000000F)
#define RTC_ALARMA_SEU_0  ((uint32_t)0x00000001)
#define RTC_ALARMA_SEU_1  ((uint32_t)0x00000002)
#define RTC_ALARMA_SEU_2  ((uint32_t)0x00000004)
#define RTC_ALARMA_SEU_3  ((uint32_t)0x00000008)

